# -*- coding: utf-8 -*-"
#+STARTUP: overview indent
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 9.0.1)
#+LATEX_HEADER:
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export
#+TAGS: noexport(n) deprecated(d)

* Cronograma

#+header: :var aulas=listagem_de_encontros
#+begin_src R :results value table :session :exports output :colnames yes
aulas %>%
    mutate(N = 1:nrow(.)) %>%
    select(N, Setor, Descrição)
#+end_src

#+RESULTS:
|  N | Setor       | Descrição                                             |
|----+-------------+-------------------------------------------------------|
|  1 | Geral       | Apresentação da disciplina                            |
|  2 | Geral       | Introdução geral                                      |
|  3 | Arquitetura | Introdução Exascale                                   |
|  4 | Arquitetura | Revisão Pipeline                                      |
|  5 | Arquitetura | Superescalar                                          |
|  6 | Arquitetura | Gerenciamento de desvios                              |
|  7 | Arquitetura | Dependências e Escalonamento                          |
|  8 | Arquitetura | Superpipeline e VLIW                                  |
|  9 | Arquitetura | Arquiteturas Multithread                              |
| 10 | Arquitetura | Multicore                                             |
| 11 | Arquitetura | Virtualização                                         |
| 12 | Arquitetura | Interconexão                                          |
| 13 | Arquitetura | Arquitetura SIMD                                      |
| 14 | Modelos     | Introdução e Motivação                                |
| 15 | Modelos     | Resolvendo em Paralelo                                |
| 16 | MPI         | Introdução, SMPI, Operações ponto-a-ponto             |
| 17 | MPI         | Operações coletivas                                   |
| 18 | MPI         | Operações assíncronas, modos de envio                 |
| 19 | MPI         | Topologias virtuais, processos dinâmicos e fechamento |
| 20 | OpenMP      | Introdução, Algoritmos de escalonamento               |
| 21 | OpenMP      | Paralelismo de tarefas, Sincronização                 |
| 22 | OpenMP      | Prática em laboratório                                |
| 23 | StarPU      | Introdução, DAG                                       |
| 24 | Análise     | Introdução a Análise de Desempenho                    |
